blog/2020/11/09/config-faq/index.html
<!DOCTYPE html>
<html lang="en-us">
<head>
  <title>总结: 系统配置常见问题及答案 - 你对这个世界要有点意见</title>
  <meta charset="utf-8" />
  <meta name="author" content="lijigang" />


  <link rel="alternate" title="RSS Feed" href="/rss.xml" type="application/rss+xml">
  <link rel="stylesheet" href="/media/css/main.css" type="text/css">
  <link rel="stylesheet" href="/media/css/posts.css" type="text/css">
</head>

  <body class="container">
<header id="header">
<body>
    <nav class="navbar navbar-default navbar-fixed-top" style="opacity: .9" role="navigation">
        <div class="container-fluid">
<div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target="#bs-example-navbar-collapse-1">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="/">你对这个世界要有点意见</a>
        </div>
<div class="collapse navbar-collapse" id="bs-example-navbar-collapse-1">
            <ul class="nav navbar-nav navbar-right">
                <li class="active"><a href="/">Blog</a></li>
          <li><a href="https://github.com/lijigang">GitHub</a></li>
          <li><a href="http://www.zhihu.com/people/lijigang.com">知乎</a></li>
        </ul>
</div>
</div>
    </nav>
</body>
</header>

<section id="content" role="main">
    <div id="outline-container-sec-" class="row post-content">
        <div class="col-md-2"></div>
            <h1>总结: 系统配置常见问题及答案</h1>
            
<div id="outline-container-orgb75eb15" class="outline-2">
<h2 id="orgb75eb15">Github</h2>
<div class="outline-text-2" id="text-orgb75eb15">
<pre class="example" id="org43ecfff">
使用 Homebrew 安装 Emacs 时, 出现类似提示:

Failed to connect to raw.githubusercontent.com port 443: Connection refused
</pre>

<blockquote>
<p>
解答: 修改 Hosts
</p>

<ol class="org-ol">
<li>通过 <a href="https://www.ipaddress.com/">https://www.ipaddress.com/</a> 查询 raw.githubusercontent.com 的 IP 地址</li>
<li><p>
修改 /private/etc/hosts 文件, 增加一行:
</p>

<p>
查到的 IP raw.githubusercontent.com
</p></li>
</ol>
</blockquote>
</div>
</div>

<div id="outline-container-orga0e42e1" class="outline-2">
<h2 id="orga0e42e1">Homebrew</h2>
<div class="outline-text-2" id="text-orga0e42e1">
</div>
<div id="outline-container-orgf116ff4" class="outline-3">
<h3 id="orgf116ff4">是什么?</h3>
<div class="outline-text-3" id="text-orgf116ff4">
<blockquote>
<p>
Homebrew是 mac的包管理器，仅需执行相应的命令,就能下载安装需要的软件包，可以省掉自己去下载、解压、拖拽(安装)等繁琐的步骤。
</p>

<p>
<a href="https://www.cnblogs.com/joyce33/p/13376752.html">This blog</a>
</p>
</blockquote>

<p>
Homebrew 主要由四个部分组成: brew、homebrew-core 、homebrew-cask、homebrew-bottles，它们对应的功能如下：
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">组成</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homebrew</td>
<td class="org-left">源代码仓库</td>
</tr>

<tr>
<td class="org-left">homebrew-core</td>
<td class="org-left">Homebrew 核心源</td>
</tr>

<tr>
<td class="org-left">homebrew-cask</td>
<td class="org-left">提供macos应用和大型二进制文件的安装</td>
</tr>

<tr>
<td class="org-left">homebrew-bottles</td>
<td class="org-left">预编译二进制软件包</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-orgf29e6ee" class="outline-3">
<h3 id="orgf29e6ee">问题是?</h3>
<div class="outline-text-3" id="text-orgf29e6ee">
<ol class="org-ol">
<li><p>
安装Homebrew 时速度超级慢
</p>

<blockquote>
<p>
解答: 从中科大的镜像源下载安装 Homebrew
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-shell">/usr/bin/ruby -e "$(curl -fsSL https://cdn.jsdelivr.net/gh/ineo6/homebrew-install/install)"
</pre>
</div></li>

<li><p>
安装Homebrew 时, 卡在了Cloning into 环节
</p>

<blockquote>
<p>
解答: 按C-c 中断下载, 更新下载源
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-shell">cd "$(brew --repo)/Library/Taps/"
mkdir homebrew &amp;&amp; cd homebrew
git clone git://mirrors.ustc.edu.cn/homebrew-core.git

</pre>
</div></li>

<li><p>
安装成功后, 使用brew install 软件 速度超级慢
</p>

<blockquote>
<p>
解答: 继续更改软件包的下载源
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-shell"># 替换 brew.git：
git -C "$(brew --repo)" remote set-url origin https://mirrors.ustc.edu.cn/brew.git

# 替换 homebrew-core.git：
git -C "$(brew --repo homebrew/core)" remote set-url origin https://mirrors.ustc.edu.cn/homebrew-core.git

# 替换 homebrew-cask.git：
git -C "$(brew --repo homebrew/cask)" remote set-url origin https://mirrors.ustc.edu.cn/homebrew-cask.git

# 替换homebrew-bottles：
# 首先要先区分你的mac用哪种终端工具，如果是 bash，则执行：
echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.ustc.edu.cn/homebrew-bottles' &gt;&gt; ~/.bash_profile
source ~/.bash_profile

# 若是 zsh，则执行：
echo 'export HOMEBREW_BOTTLE_DOMAIN=https://mirrors.ustc.edu.cn/homebrew-bottles' &gt;&gt; ~/.zshrc
source ~/.zshrc

</pre>
</div></li>
</ol>
</div>
</div>
</div>

    </div>
</section>




<footer id="footer">
    <br />
    <script>
        var _hmt = _hmt || [];
        (function() {
            var hm = document.createElement("script");
            hm.src = "https://hm.baidu.com/hm.js?36d44a2295ffa55a3ab51c6aa7a71733";
            var s = document.getElementsByTagName("script")[0];
            s.parentNode.insertBefore(hm, s);
        })();
    </script>
</footer>

  </body>
</html>
